status/2021/09jul21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>03 July 2021 - 09 July 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">03 July 2021 - 09 July 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf336494">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org343f2cc">1.1. Next step</a>
<ul>
<li><a href="#org857ac18">1.1.1. Order any needed supplies</a></li>
<li><a href="#orgb16e762">1.1.2. Assemble and test</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8a4fe81">2. Swocer</a>
<ul>
<li><a href="#org2461d97">2.1. Most crashing addressed</a></li>
<li><a href="#orgac4c651">2.2. Added outline for 'bottle' test</a></li>
<li><a href="#orgf099a1d">2.3. Next steps</a></li>
</ul>
</li>
<li><a href="#org13643d4">3. Soap Molds</a></li>
<li><a href="#org5860511">4. ca-r</a>
<ul>
<li><a href="#org9a40a52">4.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org02c58d0">5. Linux Audio</a>
<ul>
<li><a href="#org1bc0fa2">5.1. CSound programming.</a>
<ul>
<li><a href="#orgc139ff6">5.1.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org713db97">5.2. Faust programming</a>
<ul>
<li><a href="#orge7fc297">5.2.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2642428">6. EPICS</a>
<ul>
<li><a href="#org4d50275">6.1. Next steps</a>
<ul>
<li><a href="#orga5125ad">6.1.1. u3scpi network port testing</a></li>
<li><a href="#org4e5805f">6.1.2. initial EPICS interface</a></li>
<li><a href="#org18be2a1">6.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbd17e6c">7. Brini Tracker II</a>
<ul>
<li><a href="#org9cadaf8">7.1. Next steps</a>
<ul>
<li><a href="#org8bb70dd">7.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orgcbf960f">7.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org51fc677">7.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga34b4e1">8. wktcolor</a>
<ul>
<li><a href="#org51e9c97">8.1. Next steps</a>
<ul>
<li><a href="#org01df8e8">8.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2ec92e1">9. wktplot</a>
<ul>
<li><a href="#org400f936">9.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgbfad205">10. AMDGPU</a>
<ul>
<li><a href="#org5063843">10.1. Next step</a>
<ul>
<li><a href="#orgcb46d97">10.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf761a31">11. Ninja v Make</a>
<ul>
<li><a href="#orge427ebe">11.1. Next Step</a>
<ul>
<li><a href="#org2152669">11.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgae1aba8">12. GMP Forth</a></li>
</ul>
</div>
</div>
<p>
Quiet Forth of July
</p>

<div id="outline-container-orgf336494" class="outline-2">
<h2 id="orgf336494"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Most Particle Monitor shelter parts fabricated.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Part</th>
<th scope="col" class="org-right">Quan.</th>
<th scope="col" class="org-left">Designed?</th>
<th scope="col" class="org-left">Fabricated?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vent connector mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent connector cover</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent mount</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM box</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM lid</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Baffle</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen holder</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Inlet shroud</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box mount</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Vent/UV mount</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(1)</td>
</tr>

<tr>
<td class="org-left">UV Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
(1) Likely will just reuse previous assembly
</p>
</div>

<div id="outline-container-org343f2cc" class="outline-3">
<h3 id="org343f2cc"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org857ac18" class="outline-4">
<h4 id="org857ac18"><span class="section-number-4">1.1.1.</span> Order any needed supplies</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Screws. Need to establish a better source of hardware as existing
sources have finally dried up. I'm not paying $0.50 each for a
#4x1/4" sheet metal screw.
</p>
</div>
</div>

<div id="outline-container-orgb16e762" class="outline-4">
<h4 id="orgb16e762"><span class="section-number-4">1.1.2.</span> Assemble and test</h4>
</div>
</div>
</div>

<div id="outline-container-org8a4fe81" class="outline-2">
<h2 id="org8a4fe81"><span class="section-number-2">2.</span> Swocer</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2461d97" class="outline-3">
<h3 id="org2461d97"><span class="section-number-3">2.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-orgac4c651" class="outline-3">
<h3 id="orgac4c651"><span class="section-number-3">2.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orgf099a1d" class="outline-3">
<h3 id="orgf099a1d"><span class="section-number-3">2.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
<div id="outline-container-org13643d4" class="outline-2">
<h2 id="org13643d4"><span class="section-number-2">3.</span> Soap Molds</h2>
<div class="outline-text-2" id="text-3">
<p>
Investigating mold making for hand soaps (for Annie).
Need to implement 'drafts' in swocer if I go that route.
</p>
</div>
</div>
<div id="outline-container-org5860511" class="outline-2">
<h2 id="org5860511"><span class="section-number-2">4.</span> ca-r</h2>
<div class="outline-text-2" id="text-4">
<p>
Tier data finally deprecated so processing is removed.
</p>
</div>
<div id="outline-container-org9a40a52" class="outline-3">
<h3 id="org9a40a52"><span class="section-number-3">4.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-4-1">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-org02c58d0" class="outline-2">
<h2 id="org02c58d0"><span class="section-number-2">5.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org1bc0fa2" class="outline-3">
<h3 id="org1bc0fa2"><span class="section-number-3">5.1.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-orgc139ff6" class="outline-4">
<h4 id="orgc139ff6"><span class="section-number-4">5.1.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-5-1-1">
</div>
<ol class="org-ol">
<li><a id="orga33fee3"></a>loscil demo<br /></li>
<li><a id="org9dfa7d4"></a>pvanal to spectrogram<br /></li>
<li><a id="orgba4c172"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org713db97" class="outline-3">
<h3 id="org713db97"><span class="section-number-3">5.2.</span> Faust programming</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orge7fc297" class="outline-4">
<h4 id="orge7fc297"><span class="section-number-4">5.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-5-2-1">
</div>
<ol class="org-ol">
<li><a id="org25c2055"></a>GAC Patch save/restore<br /></li>
<li><a id="orga0fad39"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-5-2-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org2b1c34a"></a>OSC control surface<br />
<div class="outline-text-5" id="text-5-2-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org734dc8d"></a>Faust/csound<br />
<div class="outline-text-5" id="text-5-2-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org2642428" class="outline-2">
<h2 id="org2642428"><span class="section-number-2">6.</span> EPICS</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org4d50275" class="outline-3">
<h3 id="org4d50275"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orga5125ad" class="outline-4">
<h4 id="orga5125ad"><span class="section-number-4">6.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org4e5805f" class="outline-4">
<h4 id="org4e5805f"><span class="section-number-4">6.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org18be2a1" class="outline-4">
<h4 id="org18be2a1"><span class="section-number-4">6.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-orgbd17e6c" class="outline-2">
<h2 id="orgbd17e6c"><span class="section-number-2">7.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-7">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-org9cadaf8" class="outline-3">
<h3 id="org9cadaf8"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org8bb70dd" class="outline-4">
<h4 id="org8bb70dd"><span class="section-number-4">7.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orgcbf960f" class="outline-4">
<h4 id="orgcbf960f"><span class="section-number-4">7.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org51fc677" class="outline-4">
<h4 id="org51fc677"><span class="section-number-4">7.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orga34b4e1" class="outline-2">
<h2 id="orga34b4e1"><span class="section-number-2">8.</span> wktcolor</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org51e9c97" class="outline-3">
<h3 id="org51e9c97"><span class="section-number-3">8.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org01df8e8" class="outline-4">
<h4 id="org01df8e8"><span class="section-number-4">8.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org2ec92e1" class="outline-2">
<h2 id="org2ec92e1"><span class="section-number-2">9.</span> wktplot</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org400f936" class="outline-3">
<h3 id="org400f936"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-orgbfad205" class="outline-2">
<h2 id="orgbfad205"><span class="section-number-2">10.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org5063843" class="outline-3">
<h3 id="org5063843"><span class="section-number-3">10.1.</span> Next step</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-orgcb46d97" class="outline-4">
<h4 id="orgcb46d97"><span class="section-number-4">10.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orgf761a31" class="outline-2">
<h2 id="orgf761a31"><span class="section-number-2">11.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orge427ebe" class="outline-3">
<h3 id="orge427ebe"><span class="section-number-3">11.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-org2152669" class="outline-4">
<h4 id="org2152669"><span class="section-number-4">11.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orgae1aba8" class="outline-2">
<h2 id="orgae1aba8"><span class="section-number-2">12.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-12">
<p>
Need to think about adding floating point support
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>